Hi, I am facing a similar issue with the `partitioning_enabled` attribute on the `azurerm_servicebus_queue` resource.

When changing `enable_partitioning` to `partitioning_enabled` in the code, it is ignored and `enable_partitioning` revert to its default value which cause the plan to suggest the recreation of the queue.

Here is the code:
```hcl
resource "azurerm_servicebus_queue" "main" {
  name                                 = "queue-name"
  namespace_id                         = local.service_bus.id
  dead_lettering_on_message_expiration = false
  partitioning_enabled                 = true
}
```

And the plan output:
```hcl
# azurerm_servicebus_queue.main must be replaced
-/+ resource "azurerm_servicebus_queue" "main" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ batched_operations_enabled              = true -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      ~ enable_partitioning                     = true -> false # forces replacement
      ~ express_enabled                         = false -> (known after apply)
      ~ id                                      = "/subscriptions/..." -> (known after apply)
      ~ lock_duration                           = "PT1M" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
      ~ max_size_in_megabytes                   = 5120 -> (known after apply)
        name                                    = "queue-name"
        # (11 unchanged attributes hidden)
    }
```

It works on `azurerm_servicebus_topic` resource though.

Since the issue is on a different resource than the one referenced in this issue, let me know if I should open a new issue for `azurerm_servicebus_queue`